Repository: olgashpyakina/ElecardBoro
Catalog: docs/locale/*/LC_MESSAGES/quickstart.po
Languages: ru

source: Quick Start
ru: Начало работы

source: Step 1. Register your account and get the probe
ru: Шаг 1. Зарегистрируйте аккаунт и получите зонд

source: To `register <http://boro.elecard.ru/users/sign_up/>`_ fill in the **e-mail** and **password** fields. You will get a confirmation email with an activation link. Please confirm your registration.
ru: Для `регистрации <http://boro.elecard.ru/users/sign_up/>`_ необходимо заполнить поля **e-mail** и **пароль**. На вашу электронную почту придет запрос о подтверждении регистрации. Пожалуйста, перейдите по полученной ссылке.

source: `Log in <http://boro.elecard.ru/users/sign_in>`_ and create a project by clicking the button:
ru: `Войдите в систему <http://boro.elecard.ru/users/sign_in>`_ и создайте проект, нажав на кнопку:

source: You will be redirected to the project page automatically. Download the probe's archive file by clicking the button:
ru: После создания проекта вы будете автоматически перенаправлены на страницу проекта. Скачайте архив с приложениями зонда, нажав на кнопку:

source: Extract the downloaded archive to a required directory.
ru: Распакуйте архив в выбранную директорию.

source: Choose a folder matching your operating system (lin32/64, win32/64).
ru: Выберите папку, соответствующую вашей операционной системе (Lin32/64, Win32/64).

source: *Note: the archive file is attached to the current project only.*
ru: *Примечание: скачанный архив связан только с данным проектом!*

source: Step 2. Set up and run the probe
ru: Шаг 2. Настройте и запустите зонд

source: Edit **monitor.cfg** in a chosen folder. Edit **"AppDescription"** field to change the probe name (the file must be in the UTF-8 if you use non-alphanumeric symbols).
ru: В выбранной папке, в файле **monitor. cfg** необходимо отредактировать название зонда - значение поля **"AppDescription"** (файл должен быть сохранен в кодировке UTF-8, если вы используете отличные от латиницы и цифр символы).

source: Edit **proxy server** in **monitor.cfg** file if it is necessary. Then enable it by deleting "//" symbols at the beginning of the line.
ru: При необходимости, в файле **monitor. cfg** отредактируйте **proxy сервер** и задействуйте его, убрав символы "//" в начале строки.

source: Run **streamMonitor.exe** in your command prompt (./streamMonitor - OC Linux).
ru: Запустите в командной строке **streamMonitor.exe** (./streamMonitor - OC Linux).

source: For Windows OS: allow **streamMonitor.exe** to communicate in public and private networks (set two check boxes in the Windows Firewall).
ru: Для ОС Windows: разрешите использовать частные и публичные сети для работы **streamMonitor.exe** (установите две галочки в Брандмауэре Windows).

source: Step 3. Set tasks to the probe
ru: Шаг 3. Поставьте задачи зонду

source: After running the probe, the service page should update automatically. Open the sidebar containing the name of your probe and click it.
ru: После запуска зонда страница сервиса должна автоматически обновиться. Раскройте боковую панель, на которой отобразится имя вашего зонда. Кликните на него.

source: To set a task for the analysis click the button:
ru: Для постановки задач на анализ кликните кнопку:

source: Fill in the fields listed below and click the "Run" button in the resulting window. You can run several streams simultaneously.
ru: В появившемся окне необходимо заполнить указанные ниже поля и нажать кнопку "Запустить". Одновременно можно запускать несколько потоков.

source: **URI** - location of the streams to be analyzed (supported prefixes are: file://, udp://, rtp://, http://, https://).
ru: **URI** - адрес потока, который будет анализироваться (поддерживаются следующие префиксы: file://, udp://, rtp://, http://, https://).

source: **Name** - name of the analyzed stream.
ru: **Имя** - название анализируемого потока.

source: **Network interface IP** - NIC IP address used by the probe to receive the stream. Leave it blank if you want the probe to work according to the routing table.
ru: **IP сетевого интерфейса** - IP адрес сетевого интерфейса, через который анализатор будет пытаться получить поток. Оставьте это поле пустым, если хотите, чтобы анализатор работал согласно системной таблице маршрутизации.

source: Click the "LiveView" icon to check the run visually.
ru: Визуально проконтролировать запуск можно, кликнув по значку "Диаграмма".

source: For detailed information about the stream click its name.
ru: Кликните на имя потока для получения детальной информации о нем.

source: *Note: the user is able to analyze up to 10 streams for 7 days right after the registration. Contact the technical support team to get a 30-day trial version using the "Contact us" form.*
ru: *Примечание: на семь дней после регистрации пользователю дается возможность поставить на анализ до 10 потоков. Обратитесь в команду технической поддержки для получения бесплатного 30ти дневного доступа к сервису, используя "Обратную связь".*
